Revit 2027 API
Form.IsCurveReference Method
Tell if the pick is the reference to a curve of the form.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsCurveReference(
	Reference curveReference
)
Public Function IsCurveReference (
	curveReference As Reference
) As Boolean
public:
bool IsCurveReference(
	Reference^ curveReference
)
member IsCurveReference :
        curveReference : Reference -> bool
Parameters
curveReference Reference
Reference to be checked.
Return Value
Boolean
See Also
Reference
Form Class
Autodesk.Revit.DB Namespace